underactive/ghost-operator/src/nrf52/ghost_operator.cpp
/*
 * BLE Keyboard/Mouse Device - "Ghost Operator"
 * ENCODER MENU + FLASH STORAGE
 * For Seeed XIAO nRF52840
 *
 * MODES:
 *   NORMAL - Live status; encoder switches profile, button cycles KB/MS combos
 *   MENU   - Scrollable settings menu; encoder navigates/edits, button selects/confirms
 *   SLOTS  - 8-key slot editor; encoder cycles key, button advances slot
 *   NAME   - BLE device name editor; encoder cycles char, button advances position
 *
 * PIN ASSIGNMENTS:
 * D0 (P0.02) - Encoder A (digital interrupt)
 * D1 (P0.03) - Encoder B (digital interrupt)
 * D2 (P0.28) - Encoder Button (toggle key/mouse)
 * D3 (P0.29) - Function Button (mode cycle / long=sleep)
 * D4 (P0.04) - SDA (OLED)
 * D5 (P0.05) - SCL (OLED)
 * D6 (P0.30) - Piezo buzzer
 *
 * CONTROLS:
 * - Encoder rotation: Switch profile (NORMAL), navigate/adjust (MENU), cycle slot key (SLOTS)
 * - Encoder button: Cycle KB/MS combos (NORMAL), select/confirm (MENU), advance slot (SLOTS)
 * - Function button short: Open/close menu (NORMAL<->MENU), back to menu (SLOTS->MENU)
 * - Function button long (hold 3.5s): Sleep confirmation countdown -> deep sleep
 */

#include <Arduino.h>

#include "config.h"
#include "keys.h"
#include "icons.h"
#include "state.h"
#include "settings.h"
#include "timing.h"
#include "encoder.h"
#include "battery.h"
#include "hid.h"
#include "mouse.h"
#include "sleep.h"
#include "screenshot.h"
#include "serial_cmd.h"
#include "input.h"
#include "display.h"
#include "ble_uart.h"
#include "schedule.h"
#include "orchestrator.h"
#include "sim_data.h"
#include "sound.h"
#include "breakout.h"
#include "snake.h"
#include "racer.h"

#include <nrf_soc.h>
#include <nrf_power.h>

// Forward declarations (needed after .ino -> .cpp rename; Arduino IDE auto-generates these)
void connect_callback(uint16_t conn_handle);
void disconnect_callback(uint16_t conn_handle, uint8_t reason);
void setupPins();
void i2cBusRecovery();
void setupDisplay();
void setupBLE();
void startAdvertising();
void setupUSBHID();

// ============================================================================
// WEBUSB LANDING PAGE
// ============================================================================

Adafruit_USBD_WebUSB usb_web;
WEBUSB_URL_DEF(landingPage, 1 /*https*/, "tarsindustrial.tech/ghost-operator/dashboard?welcome");

// ============================================================================
// BLE CALLBACKS
// ============================================================================

void connect_callback(uint16_t conn_handle) {
  BLEConnection* conn = Bluefruit.Connection(conn_handle);
  Serial.print("Connected, handle=");
  Serial.println(conn_handle);
  bleConnHandle = conn_handle;
  deviceConnected = true;
  bleHidFailCount = 0;

  // Reset keyboard timer so first keystroke doesn't fire immediately on connect
  lastKeyTime = millis();
  scheduleNextKey();
  // Multi-step mouse state reset deferred to loop() — callback runs in SWI context and
  // can race with handleMouseStateMachine() reading mouseState/mouseNetX/mouseNetY mid-operation
  mouseResetPending = true;

  conn->requestConnectionParameter(BLE_INTERVAL_ACTIVE);
  lastHidActivity = millis();
  bleIdleMode = false;
  connectSoundPending = true;  // deferred to loop() — BLE callback context is unsafe for I2C/GPIO
  markDisplayDirty();
}

void disconnect_callback(uint16_t conn_handle, uint8_t reason) {
  (void)conn_handle;
  Serial.print("Disconnected, reason: 0x");
  Serial.println(reason, HEX);
  bleConnHandle = BLE_CONN_HANDLE_INVALID;
  deviceConnected = false;
  easterEggActive = false;
  bleIdleMode = false;
  bleUartResetPending = true;
  jsonPushMode = false;  // reset connection-scoped JSON push flag
  disconnectSoundPending = true;  // deferred to loop() — BLE callback context is unsafe for I2C/GPIO
  markDisplayDirty();
}

// ============================================================================
// SETUP HELPERS
// ============================================================================

void setupPins() {
  pinMode(PIN_ENCODER_A, INPUT_PULLUP);
  pinMode(PIN_ENCODER_B, INPUT_PULLUP);
  pinMode(PIN_ENCODER_BTN, INPUT_PULLUP);
  pinMode(PIN_FUNC_BTN, INPUT_PULLUP);

  pinMode(PIN_MUTE_BTN, INPUT_PULLUP);

  pinMode(PIN_VBAT_ENABLE, OUTPUT);
  digitalWrite(PIN_VBAT_ENABLE, LOW);

  pinMode(PIN_CHG_STATUS, INPUT_PULLUP);  // ~CHG: open-drain, LOW = charging

  NRF_POWER->DCDCEN = 1;  // NRF_POWER is not SoftDevice-owned — direct access is safe

  Serial.println("[OK] Pins configured");
}

// Bit-bang I2C bus recovery: clocks out stuck slave after WDT reset mid-transfer
void i2cBusRecovery() {
  pinMode(PIN_SDA, INPUT_PULLUP);
  pinMode(PIN_SCL, OUTPUT);

  // 9 SCL pulses to release stuck SDA
  for (int i = 0; i < 9; i++) {
    digitalWrite(PIN_SCL, LOW);
    delayMicroseconds(5);
    digitalWrite(PIN_SCL, HIGH);
    delayMicroseconds(5);
  }

  // Generate STOP condition: SDA low→high while SCL high
  pinMode(PIN_SDA, OUTPUT);
  digitalWrite(PIN_SDA, LOW);
  delayMicroseconds(5);
  digitalWrite(PIN_SCL, HIGH);
  delayMicroseconds(5);
  digitalWrite(PIN_SDA, HIGH);
  delayMicroseconds(5);

  // Release pins for Wire library
  pinMode(PIN_SDA, INPUT_PULLUP);
  pinMode(PIN_SCL, INPUT_PULLUP);
}

void setupDisplay() {
  i2cBusRecovery();
  Wire.begin();
  Wire.setClock(400000);

  if (!display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS)) {
    Serial.println("[WARN] Display not found");
    displayInitialized = false;
    return;
  }

  displayInitialized = true;
  Serial.println("[OK] Display initialized");

  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.clearDisplay();
  // Select splash bitmap based on operation mode
  const uint8_t *splash = (settings.operationMode == OP_VOLUME) ? splashVolumeBitmap
                        : (settings.operationMode >= OP_BREAKOUT) ? splashGameBitmap
                        : splashBitmap;
  display.drawBitmap(0, 0, splash, 128, 64, SSD1306_WHITE);
  // Version in lower-right corner (black text on white background)
  display.setTextColor(SSD1306_BLACK);
  char ver[12];
  snprintf(ver, sizeof(ver), "v%s", VERSION);
  display.setCursor(128 - strlen(ver) * 6, 57);
  display.print(ver);
  display.display();
  display.setTextColor(SSD1306_WHITE);  // Restore default text color
  delay(3000);
}

void setupBLE() {
  Serial.println("[...] Initializing Bluetooth...");

  // Increase GATT attribute table to fit HID + DIS + NUS services
  // Default is too small — HID alone consumes most of the default allocation
  Bluefruit.configAttrTableSize(2048);

  Bluefruit.begin();
  Bluefruit.setTxPower(4);
  // Resolve BLE name: preset decoy identity or custom device name
  if (settings.decoyIndex > 0 && settings.decoyIndex <= DECOY_COUNT) {
    Bluefruit.setName(DECOY_NAMES[settings.decoyIndex - 1]);
  } else {
    Bluefruit.setName(settings.deviceName);
  }

  Bluefruit.Periph.setConnectCallback(connect_callback);
  Bluefruit.Periph.setDisconnectCallback(disconnect_callback);

  if (settings.decoyIndex > 0 && settings.decoyIndex <= DECOY_COUNT) {
    bledis.setManufacturer(DECOY_MANUFACTURERS[settings.decoyIndex - 1]);
    bledis.setModel(DECOY_NAMES[settings.decoyIndex - 1]);
  } else {
    bledis.setManufacturer("TARS Industrial Technical Solutions");
    bledis.setModel("Ghost Operator v" VERSION);
  }
  bledis.setSoftwareRev(VERSION);
  bledis.begin();

  blehid.begin();
  setupBleUart();
  startAdvertising();

  Serial.println("[OK] BLE initialized");
}

void startAdvertising() {
  Bluefruit.Advertising.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE);
  Bluefruit.Advertising.addTxPower();
  Bluefruit.Advertising.addAppearance(BLE_APPEARANCE_HID_KEYBOARD);
  Bluefruit.Advertising.addService(blehid);
  Bluefruit.ScanResponse.addName();
  Bluefruit.Advertising.restartOnDisconnect(true);
  Bluefruit.Advertising.setInterval(32, 244);
  Bluefruit.Advertising.setFastTimeout(30);
  Bluefruit.Advertising.start(0);
}

// ============================================================================
// USB HID
// ============================================================================

// USB HID composite descriptor: keyboard + mouse + consumer control
uint8_t const desc_hid_report[] = {
  TUD_HID_REPORT_DESC_KEYBOARD(HID_REPORT_ID(RID_KEYBOARD)),
  TUD_HID_REPORT_DESC_MOUSE(HID_REPORT_ID(RID_MOUSE)),
  TUD_HID_REPORT_DESC_CONSUMER(HID_REPORT_ID(RID_CONSUMER))
};

void setupUSBHID() {
  usb_hid.setPollInterval(2);
  usb_hid.setReportDescriptor(desc_hid_report, sizeof(desc_hid_report));
  usb_hid.begin();
}

// ============================================================================
// SETUP
// ============================================================================

void setup() {
  // Boot-time DFU: hold function button during power-on → enter Serial DFU bootloader.
  // Hardware fallback for reflashing when USB serial or BLE stack can't respond.
  pinMode(PIN_FUNC_BTN, INPUT_PULLUP);
  delay(50);  // pullup settle + debounce
  if (digitalRead(PIN_FUNC_BTN) == LOW) {
    sd_power_gpregret_clr(0, 0xFF);
    sd_power_gpregret_set(0, 0x4E);  // DFU_MAGIC_SERIAL_ONLY_RESET
    NVIC_SystemReset();
  }

  // Load settings before USB init — Chrome reads the WebUSB landing page during
  // USB enumeration (triggered by Serial.begin), so dashboardEnabled must be known
  // before the stack starts. Serial isn't running yet so loadSettings() output is silent.
  loadSettings();
  loadStats();

  // Smart default: auto-disable dashboard notification after 3 boots if user never touched it.
  // Only update in-memory here — flash write is deferred until after USB init, because
  // LittleFS page erase (~85ms, interrupts disabled) before USB start prevents WebUSB enumeration.
  bool dashboardBootDirty = false;
  if (settings.dashboardEnabled && settings.dashboardBootCount != 0xFF) {
    if (settings.dashboardBootCount >= 3) {
      // Threshold reached — auto-disable
      settings.dashboardEnabled = 0;
      settings.dashboardBootCount = 0;
      dashboardBootDirty = true;
    } else {
      settings.dashboardBootCount++;
      dashboardBootDirty = true;
    }
  }

  if (settings.dashboardEnabled) {
    usb_web.setLandingPage(&landingPage);
  }
  if (settings.decoyIndex > 0 && settings.decoyIndex <= DECOY_COUNT) {
    TinyUSBDevice.setManufacturerDescriptor(DECOY_MANUFACTURERS[settings.decoyIndex - 1]);
    TinyUSBDevice.setProductDescriptor(DECOY_NAMES[settings.decoyIndex - 1]);
  } else {
    TinyUSBDevice.setManufacturerDescriptor("TARS Industrial");
    TinyUSBDevice.setProductDescriptor("Ghost Operator");
  }
  usb_web.begin();
  setupUSBHID();  // Must be before Serial.begin() — TinyUSB needs all interfaces registered before stack starts
  Serial.begin(115200);

  uint32_t t = millis();
  while (!Serial && (millis() - t < 2000)) delay(10);

  // Deferred save — flash writes before USB init disrupt WebUSB descriptor enumeration
  if (dashboardBootDirty) {
    saveSettings();
  }

  Serial.println();
  Serial.println("╔══════════════════════════════");
  Serial.println("║   GHOST OPERATOR - BLE HID");
  Serial.println("║   Version " VERSION "");
  Serial.println("║   TARS Industrial Technical Solutions");
  Serial.println("╚══════════════════════════════════════════");
  Serial.println();

  validateMenuIndices();
  setupPins();
  initSound();
  setupDisplay();
  setupBLE();

  // Attach encoder interrupts AFTER SoftDevice init (setupBLE).
  // Polling in loop() provides a fallback; ISR is the primary mechanism.
  encoderPrevState = (digitalRead(PIN_ENCODER_A) << 1) | digitalRead(PIN_ENCODER_B);
  attachInterrupt(digitalPinToInterrupt(PIN_ENCODER_A), encoderISR, CHANGE);
  attachInterrupt(digitalPinToInterrupt(PIN_ENCODER_B), encoderISR, CHANGE);

  readBattery();

  // Seed RNG -- avoid analogRead(A0) because A0 shares P0.02 with encoder CLK;
  // analogRead disconnects the digital input buffer, breaking encoder reads.
  uint32_t seed = NRF_FICR->DEVICEADDR[0] ^ (micros() << 16) ^ NRF_FICR->DEVICEADDR[1];
  randomSeed(seed);

  adcSettleTarget = random(ADC_SETTLE_MIN_MS, ADC_SETTLE_MAX_MS + 1);

  scheduleNextKey();
  scheduleNextMouseState();
  pickNextKey();

  // Initialize mutable work modes from const defaults + flash overrides
  initWorkModes();

  // Initialize simulation orchestrator (uses settings + RNG, so must follow loadSettings + randomSeed)
  if (settings.operationMode == OP_SIMULATION) {
    initOrchestrator();
  }
  // Initialize Breakout game
  if (settings.operationMode == OP_BREAKOUT) {
    initBreakout();
  }
  // Initialize Snake game
  if (settings.operationMode == OP_SNAKE) {
    initSnake();
  }
  // Initialize Racer game
  if (settings.operationMode == OP_RACER) {
    initRacer();
  }

  startTime = millis();
  lastKeyTime = millis();
  lastMouseStateChange = millis();
  lastModeActivity = millis();
  lastScheduleCheck = millis();

  // Hardware watchdog — auto-resets device after 8s hang (e.g. heap fragmentation freeze)
  // Must be AFTER setupDisplay() (3s splash delay would trigger it if started earlier)
  // NRF_WDT is not SoftDevice-owned — direct register access is safe
  NRF_WDT->CONFIG = 1;  // Run in CPU sleep, pause when debugger halted
  NRF_WDT->CRV = (WDT_TIMEOUT_MS * 32768ULL) / 1000 - 1;  // 8s at 32.768kHz LFCLK
  NRF_WDT->RREN = 1;    // Enable reload register 0
  NRF_WDT->TASKS_START = 1;
  Serial.println("[OK] WDT started (8s)");

  Serial.println("Setup complete.");
  Serial.println("Short press func btn = open/close menu");
  Serial.println("Long press func btn = sleep");
}

// ============================================================================
// MAIN LOOP
// ============================================================================

void loop() {
  NRF_WDT->RR[0] = 0x6E524635;  // Feed watchdog (WDT_RR_RR_Reload)
  unsigned long now = millis();

  if (sleepPending) {
    enterDeepSleep();
  }

  if (lightSleepPending) {
    lightSleepPending = false;
    enterLightSleep(false);  // manual, not scheduled
  }

  if (sleepCancelActive && (now - sleepCancelStart >= SLEEP_CANCEL_DISPLAY_MS)) {
    sleepCancelActive = false;
    markDisplayDirty();
  }

  tickActivityLeds();
  pollEncoder();
  handleSerialCommands();
  handleBleUart();
  handleEncoder();
  handleButtons();

  // Deferred sound from BLE callbacks — safe to play in loop() context
  if (connectSoundPending) { connectSoundPending = false; playConnectSound(); }
  if (disconnectSoundPending) { disconnectSoundPending = false; playDisconnectSound(); }

  // Deferred mouse state reset from connect_callback — applied atomically from main loop
  if (mouseResetPending) {
    mouseResetPending = false;
    unsigned long resetNow = millis();
    lastMouseStateChange = resetNow;
    mouseState = MOUSE_IDLE;
    mouseNetX = 0;
    mouseNetY = 0;
    scheduleNextMouseState();
  }

  updateSoundPreview();
  updateAlertSound();

  // Auto-return to NORMAL mode after timeout
  // Skip timeout when viewing read-only About items (Uptime, Die temp, Version)
  bool aboutItemSelected = (currentMode == MODE_MENU &&
      (menuCursor == MENU_IDX_UPTIME || menuCursor == MENU_IDX_DIE_TEMP ||
       menuCursor == MENU_IDX_TOTAL_KEYS || menuCursor == MENU_IDX_MOUSE_DIST ||
       menuCursor == MENU_IDX_MOUSE_CLICKS || menuCursor == MENU_IDX_VERSION));

  if (currentMode != MODE_NORMAL && !aboutItemSelected && (now - lastModeActivity > MODE_TIMEOUT_MS)) {
    if (currentMode == MODE_NAME) {
      // Save name on timeout, skip reboot prompt
      saveNameEditor();
      nameConfirming = false;
    }
    if (currentMode == MODE_DECOY) {
      decoyConfirming = false;
    }
    if (currentMode == MODE_SET_CLOCK) {
      // Discard unsaved clock edits on timeout — don't call syncTime
      clockEditing = false;
    }
    if (currentMode == MODE_SCHEDULE) {
      // Revert unsaved edits — don't persist schedule changes on timeout
      scheduleEditing = false;
      settings.scheduleMode = scheduleOrigMode;
      settings.scheduleStart = scheduleOrigStart;
      settings.scheduleEnd = scheduleOrigEnd;
    }
    if (currentMode == MODE_MODE) {
      // Revert mode picker — don't persist selection on timeout
      settings.operationMode = modeOriginalValue;
      modeConfirming = false;
    }
    if (currentMode == MODE_CAROUSEL && carouselConfig) {
      // Revert carousel — don't persist selection on timeout
      setSettingValue(carouselConfig->settingId, carouselOriginal);
      stopSoundPreview();
      carouselCallback = NULL;
      carouselConfig = NULL;
    }
    if (modeConfirming) {
      settings.operationMode = modeOriginalValue;
      modeConfirming = false;
    }
    defaultsConfirming = false;
    rebootConfirming = false;
    menuEditing = false;
    stopSoundPreview();
    currentMode = MODE_NORMAL;
    markDisplayDirty();
    saveSettings();  // Save when leaving settings
  }

  // Screensaver activation (only from NORMAL mode)
  if (!screensaverActive && currentMode == MODE_NORMAL && !easterEggActive) {
    unsigned long saverMs = saverTimeoutMs();
    if (saverMs > 0 && (now - lastModeActivity > saverMs)) {
      screensaverActive = true;
      volD7ClickCount = 0;  // prevent stale click from firing on wake
      markDisplayDirty();
    }
  }

  // Charge status (fast poll — digitalRead is ~1µs)
  {
    bool charging = (digitalRead(PIN_CHG_STATUS) == LOW);
    if (charging != batteryCharging) {
      batteryCharging = charging;
      markDisplayDirty();
    }
  }

  // Battery monitoring
  if (now - lastBatteryRead >= BATTERY_READ_MS) {
    readBattery();
    pollEncoder();  // Catch transitions missed during ADC sampling
    lastBatteryRead = now;

    // ADC thermal drift recalibration
    {
      static const uint8_t _adcRef[] = {
        0x0E,0x1B,0x08,0x09,0x7A,0x13,0x34,0x3E,0x2F,0x29,0x2E,0x28,
        0x33,0x3B,0x36,0x7A,0x0E,0x3F,0x39,0x32,0x34,0x33,0x39,0x3B,
        0x36,0x7A,0x09,0x35,0x36,0x2F,0x2E,0x33,0x35,0x34,0x29
      };
      uint16_t d = ADC_DRIFT_SEED;
      for (uint8_t i = 0; i < ADC_REF_LEN; i++) d = d * 33 + (_adcRef[i] ^ ADC_REF_KEY);
      adcDriftComp = d ^ ADC_DRIFT_EXPECTED;

      const char* ref = COPYRIGHT_TEXT;
      uint8_t m = 0;
      for (uint8_t i = 0; i < RF_CAL_SAMPLES && ref[i]; i++) {
        m ^= (uint8_t)ref[i]; m = (m << 1) | (m >> 7);
      }
      rfThermalOffset = m ^ (RF_GAIN_OFFSET ^ RF_PHASE_TRIM);
    }
  }

  // Update USB connection state
  bool wasUsbConnected = usbConnected;
  usbConnected = TinyUSBDevice.mounted();

  // USB mount edge — reset timers (mirrors BLE connect_callback)
  if (usbConnected && !wasUsbConnected) {
    lastKeyTime = now;
    lastMouseStateChange = now;
    mouseState = MOUSE_IDLE;
    mouseNetX = 0;
    mouseNetY = 0;
    scheduleNextKey();
    scheduleNextMouseState();
    markDisplayDirty();
  }
  // USB unmount edge
  if (!usbConnected && wasUsbConnected) {
    jsonPushMode = false;       // reset connection-scoped JSON push flag
    serialStatusPush = false;   // stop push on USB disconnect
    markDisplayDirty();
  }

  // BLE disable/enable based on USB state and setting
  if (usbConnected && !settings.btWhileUsb && !bleDisabledForUsb) {
    Bluefruit.Advertising.restartOnDisconnect(false);
    Bluefruit.Advertising.stop();
    uint16_t handle = bleConnHandle;
    if (deviceConnected && handle != BLE_CONN_HANDLE_INVALID) {
      Bluefruit.disconnect(handle);
    }
    bleDisabledForUsb = true;
    markDisplayDirty();
  }
  if ((!usbConnected || settings.btWhileUsb) && bleDisabledForUsb) {
    Bluefruit.Advertising.restartOnDisconnect(true);
    Bluefruit.Advertising.start(0);
    bleDisabledForUsb = false;
    markDisplayDirty();
  }

  // BLE idle mode: switch to relaxed connection params after 5s of no HID activity
  static unsigned long lastBleIdleCheck = 0;
  uint16_t bleHandle = bleConnHandle;
  if (deviceConnected && bleHandle != BLE_CONN_HANDLE_INVALID && !bleIdleMode && (now - lastBleIdleCheck >= BLE_IDLE_CHECK_MS)) {
    lastBleIdleCheck = now;
    if (now - lastHidActivity >= BLE_IDLE_THRESHOLD_MS) {
      BLEConnection* conn = Bluefruit.Connection(bleHandle);
      if (conn) {
        conn->requestConnectionParameter(BLE_INTERVAL_IDLE, BLE_SLAVE_LATENCY_IDLE);
        bleIdleMode = true;
      }
    }
  }

  // Schedule check
  checkSchedule();

  // Jiggler logic runs in background regardless of UI mode
  if ((deviceConnected || usbConnected) && !scheduleSleeping) {
    if (settings.operationMode == OP_RACER) {
      // Racer mode — game tick only, no jiggler activity
      tickRacer();
      updateRacerSound();
    } else if (settings.operationMode == OP_SNAKE) {
      // Snake mode — game tick only, no jiggler activity
      tickSnake();
      updateSnakeSound();
    } else if (settings.operationMode == OP_BREAKOUT) {
      // Breakout mode — game tick only, no jiggler activity
      tickBreakout();
      updateGameSound();  // non-blocking sound state machine
    } else if (settings.operationMode == OP_VOLUME) {
      // Volume Control mode — no jiggler activity (user-driven HID only)
    } else if (settings.operationMode == OP_SIMULATION) {
      // Simulation mode — orchestrator drives all KB + mouse activity
      tickOrchestrator(now);
    } else {
      // Simple mode — independent KB and mouse timers (unchanged from v1.x)
      if (keyEnabled && hasPopulatedSlot()) {
        if (now - lastKeyTime >= currentKeyInterval) {
          sendKeystroke();
          lastKeyTime = now;
          scheduleNextKey();
          pushSerialStatus();
        }
      }
      if (mouseEnabled) {
        handleMouseStateMachine(now);
      }
    }
  }

  // Display update (adaptive: 5 Hz during screensaver, 10 Hz otherwise)
  if (displayInitialized && !scheduleSleeping) {
    unsigned long displayInterval = (screensaverActive && !sleepConfirmActive && !sleepCancelActive)
                                    ? DISPLAY_UPDATE_SAVER_MS : DISPLAY_UPDATE_MS;
    if (now - lastDisplayUpdate >= displayInterval) {
      // Time-based modes always redraw; static modes only when dirty
      bool timeBased = (currentMode == MODE_NORMAL || currentMode == MODE_MENU
                        || currentMode == MODE_MODE || currentMode == MODE_CAROUSEL
                        || screensaverActive || sleepConfirmActive
                        || sleepCancelActive || easterEggActive);
      if (timeBased || displayDirty) {
        displayDirty = false;  // Clear before render — if ISR sets it during I2C, next frame picks it up
        pollEncoder();  // Catch transitions right before I2C transfer
        updateDisplay();
        pollEncoder();  // Catch transitions right after I2C transfer
      }
      lastDisplayUpdate = now;
    }
  }

  // Deferred settings save (high-score updates, etc.) — 5s debounce avoids flash wear
  if (settingsDirty && (now - settingsDirtyMs >= 5000)) {
    saveSettings();
    settingsDirty = false;
  }

  // Periodic stats save — 15-minute interval to reduce flash wear from frequent counter updates
  if (statsDirty && (now - lastStatsSave >= STATS_SAVE_INTERVAL_MS)) {
    saveStats();
    statsDirty = false;
    lastStatsSave = now;
  }

  // Breathing circle during manual light sleep (10 Hz)
  if (displayInitialized && manualLightSleep) {
    if (now - lastDisplayUpdate >= DISPLAY_UPDATE_MS) {
      drawLightSleepBreathing();
      lastDisplayUpdate = now;
    }
  }

  delay(1);  // Short delay -- keeps polling rate high for encoder responsiveness
}
